* Finding the PDF of the brightness fluctuations
For the discussion of the sigma POS sigma LOS correlation, we want to see whether the emissivity fluctuations  combined with radial expansion might be contributing.

If this is the case, then sigma(POS) / sigma(LOS) ought to increase as the width of the emissivity distribution increases.

In Arthur et al (2016) we showed that the emissivity sigma is about twice the surface brightness sigma, with the later being estimated from the Ha maps.

So we will calculate it for 30 Doradus in order to compare with Orion


** PDF of Ha map for 30 Dor
:PROPERTIES:
:ID:       B262582F-C826-4F60-8201-36D7FA11506E
:END:
- This is based on what I did for the Orion project
  - See [[file:../../../OrionStats/NewMoments/turb-velocity-stats.org]]
- Python program [[file:bright-hist-multi.py]] 



#+begin_src sh :results file
python bright-hist-multi.py
#+end_src

#+RESULTS:
[[file:bright-hist-multi.pdf]]



** Results
- For the majority of sources, there is not much evidence of any relation
- However, 30 Dor has significantly higher brightness fluctuations and also a significantly higher sigma ratio
- And also, significantly higher absolute sigma_pos
- Theoretical prediction for compressive forcing is that \sigma_\rho = M
  - And we should have emissivity fluctuations \sigma_E = 2 \sigma_\rho
  - And surface brightness fluctuations \sigma_S = (1/3) \sigma_E from projection
  - So we \sigma_S = (2/3) M, which we can plot
  - For solenoidal case, it is (2/9) M,



** Brightness to velocity fluctuations
- See handwritten notes
  - [[file:brightness-to-velocity-fluctuations.pdf]]
- Emissivity contrast is \alpha
- Emissivity width is
  \[
  \sigma_E = \frac{
  [3(\alpha + \alpha^{-1})^2 - 4(1 + \alpha + \alpha^{-1})]^{1/2}
  }{
  2 + \alpha + \alpha^{-1}
  }
  \]
- Line of sight velocity width
  \[
  \sigma(los) = \frac{\alpha^{1/2}}{1 + \alpha}
  \]
- Plane of sky velocity width
  \[
  \sigma(pos) = \frac{\vert\alpha - 1\vert}{2 (1 + \alpha)}
  \]


|  \alpha |    \sigma_E | \sigma(los) | \sigma(pos) | \sigma(pos) / \sigma(los) |    \sigma_S |
|----+-------+--------+--------+-----------------+-------|
|  1 |     0 |  0.500 |      0 |           0.000 |     0 |
|  2 | 0.484 |  0.471 |  0.167 |           0.355 | 0.333 |
|  3 | 0.750 |  0.433 |  0.250 |           0.577 | 0.500 |
| 10 | 1.337 |  0.287 |  0.409 |           1.425 | 0.818 |
| 30 | 1.586 |  0.177 |  0.468 |           2.644 | 0.935 |
#+TBLFM: $2=sqrt(3 ($1 + 1/$1)**2 - 4 (1 + $1 + 1/$1))/(2 + $1 + 1/$1);f3::$3=sqrt($1)/(1+$1);f3::$4=($1 - 1)/(2(1+$1));f3::$5=$4/$3;f3::$6=($1 - 1)/((1+$1));f3

So we see that \sigma(pos)increases linearly with \sigma_S. If the line-of-sight velocity difference were the same in all sources, then this would give a line like we drew in Fig 12h, but the direction of causality is the opposite here.

Previously, we were saying that the true 3d velocity fluctuations were causing the brightness fluctuations. Now, we are saying that the brightness fluctuations plus the velocity gradient are causing the apparent POS velocity fluctuations. ;

On the other hand, the los velocity dispersion decreases with increasing brightness fluctuations because we become dominated by a single layer. However the fact that we only have two layers in the toy model means that this effect is probably overestimated.

*** TODO Python program to make a graph of these relations
- Plot all those columns from the previous table against \alpha (put \alpha on a log scale)

